<PAD>
<SOS>
<EOS>
<UNK>
什
么
是
人
工
智
能
研
究
如
何
让
计
算
机
模
拟
延
伸
和
扩
展
类
的
理
论
方
法
技
术
包
括
器
学
习
深
度
自
然
语
言
处
等
一
个
分
支
通
过
析
数
据
来
改
进
动
识
别
式
规
律
使
用
多
层
神
经
网
络
次
化
表
示
在
图
像
音
领
域
取
得
突
破
受
脑
结
构
启
发
型
由
大
量
元
节
点
相
互
连
接
成
够
复
杂
解
决
问
题
明
确
步
骤
则
程
序
核
心
定
了
输
入
并
产
生
出
指
巨
样
集
合
传
统
软
件
难
以
有
效
管
需
要
新
云
提
供
可
缩
资
源
服
务
户
按
无
维
护
本
地
硬
物
联
将
设
备
实
现
体
间
信
息
交
换
控
制
区
块
链
种
布
账
加
密
保
证
不
篡
于
记
录
易
子
利
力
原
行
上
某
些
比
更
快
码
药
中
国
少
年
历
史
五
千
文
世
界
四
古
之
夏
商
周
秦
汉
朝
代
造
纸
印
刷
南
针
火
对
远
影
响
长
城
防
御
总
超
2
万
公
里
主
修
建
唐
诗
创
作
歌
典
高
峰
李
白
杜
甫
居
孔
名
丘
字
仲
尼
伟
思
想
家
教
育
儒
派
始
皇
谁
第
位
帝
六
立
书
同
车
轨
首
都
哪
北
京
全
政
治
际
往
科
最
河
江
约
6
3
0
三
山
珠
穆
朗
玛
海
拔
8
4
米
喜
马
拉
雅
脉
省
5
直
辖
市
特
太
平
洋
面
积
1
亿
占
球
水
冰
摄
氏
时
沸
腾
天
小
钟
几
季
春
秋
冬
血
常
见
A
B
O
脏
置
胸
腔
正
偏
左
循
环
系
官
获
知
验
阅
读
践
考
校
场
所
授
培
养
格
塑
功
为
开
阔
视
野
升
素
社
会
重
途
径
好
划
专
注
听
讲
及
举
反
与
健
康
义
仅
没
疾
病
而
身
适
应
良
状
态
每
该
睡
久
议
7
-
9
儿
童
眠
运
增
强
质
免
疫
善
情
活
组
部
均
衡
饮
食
碳
蛋
脂
肪
矿
营
搭
配
艺
性
达
形
绘
画
乐
舞
蹈
戏
剧
意
境
毛
笔
墨
宣
调
线
条
韵
西
写
织
感
声
济
消
费
料
关
货
币
充
当
般
价
品
值
尺
司
依
企
业
从
事
追
求
润
阳
颗
恒
星
光
热
月
亮
唯
卫
围
绕
转
引
起
潮
汐
象
近
椭
半
空
气
覆
盖
混
氮
氧
氢
H
命
燃
烧
速
秒
宇
宙
圈
昼
夜
替
圆
缺
变
期
朔
望
+
=
*
/
勾
股
角
两
边
斜
率
π
只
被
整
除
吗
罗
%
湖
青
梵
蒂
冈
他
渊
安
魏
蜀
吴
战
爆
二
束
喝
持
牙
温
觉
休
恢
至
早
餐
很
狗
寿
猫
九
这
说
灵
鱼
但
它
们
眼
睛
睁
着
鸟
飞
翅
膀
轻
便
骨
骼
扇
蜜
蜂
跳
告
诉
伴
花
距
离
植
香
味
吸
蝴
蝶
粉
昆
虫
树
细
胞
裂
顶
芽
仙
掌
耐
旱
叶
片
刺
茎
储
存
减
蒸
共
享
手
打
电
话
波
基
站
再
号
C
P
U
内
盘
显
键
W
i
F
汽
优
噪
低
日
庆
祝
农
吃
饼
征
团
端
午
纪
念
屈
曰
亦
乎
华
民
族
祖
先
目
前
已
极
稍
扁
赤
道
略
鼓
凝
聚
向
释
放
靠
射
八
黑
因
背
轴
倾
导
致
金
木
土
王
到
排
者
才
宜
D
N
即
脱
糖
酸
携
带
遗
双
螺
旋
单
膜
做
守
凭
或
失
随
融
具
荷
称
其
粒
含
描
述
慢
移
牛
顿
下
冷
映
烈
势
械
磁
真
播
振
液
固
频
幅
震
壳
板
级
岩
浆
喷
凹
陷
灰
啸
底
滑
坡
浪
沿
严
坏
台
风
附
狂
暴
雨
流
洼
头
口
广
蕴
丰
富
泊
淡
咸
隆
狭
较
坦
亚
逊
藏
盆
川
沙
漠
降
稀
乏
撒
哈
森
林
涵
候
草
畜
牧
欧
果
苹
蕉
橙
葡
萄
蔬
菜
萝
卜
红
柿
黄
瓜
粮
谷
稻
麦
玉
粱
础
肉
肌
猪
羊
鸡
奶
母
泌
乳
汁
钙
卵
材
还
壤
疏
松
石
沉
散
硅
泛
筑
遇
滴
晶
悬
浮
雾
微
落
毫
雪
压
彩
虹
折
弧
谱
绿
蓝
靛
紫
七
色
雷
炸
银
呈
猎
臂
洞
逃
坍
遮
挡
满
顺
东
段
晋
后
隋
宋
清
此
完
袭
载
甲
镐
（
今
陕
）
封
宗
鲁
霸
诸
侯
攻
伐
终
曹
鼎
繁
荣
央
权
武
刘
彻
辟
丝
绸
路
推
恩
令
贞
观
著
君
女
执
郑
监
船
队
航
壮
老
姓
耳
德
孟
轲
张
誉
圣
葛
丞
辅
佐
父
慧
岳
抗
精
忠
报
英
雄
收
湾
徐
员
虎
门
销
烟
看
故
宫
群
也
贸
促
刻
龟
兽
熟
词
苏
轼
照
辛
弃
曲
卿
窦
娥
冤
厢
楼
梦
芹
篇
游
承
僧
师
徒
演
贯
浒
施
庵
梁
非
洲
美
沟
纳
贝
尔
俄
斯
巴
陆
死
岛
屿
陵
兰
澳
堪
盛
莫
伦
敦
黎
柏
韩
渤
列
旦
勒
刚
初
穿
胶
甜
钾
柑
橘
酿
酒
暑
膳
纤
既
番
茄
胡
益
豆
淀
籽
磨
铁
泄
废
必
参
谢
帮
助
肠
蠕
预
秘
齿
锌
嗅
肥
胖
续
尿
胰
足
怎
肺
缓
危
害
绪
晚
饱
避
损
癌
症
险
肝
留
饭
毒
符
冒
勤
洗
戴
罩
室
犬
狼
驯
诚
伙
巧
敏
捷
宠
哺
脊
椎
雌
腺
幼
崽
鳃
呼
溶
窒
穷
狮
鼻
颈
鹿
脖
熊
珍
竹
属
鹅
擅
泳
鲸
豚
聪
救
蝙
蝠
蛇
蜕
皮
旧
坚
龙
肤
颜
伪
装
己
蜗
爬
腹
粘
摩
擦
蜘
蛛
住
脚
油
蜇
亡
鳞
鲜
艳
迁
徙
洄
寒
短
策
陈
捕
递
濒
临
灭
绝
虽
鹰
佳
外
倍
弱
朵
侧
根
撑
殖
孕
株
裸
露
杏
藻
衣
苔
藓
阴
湿
葫
芦
蕨
孢
肾
禾
亲
戚
羞
拢
我
枕
闭
蝇
补
笼
袋
轮
干
判
断
龄
宽
那
蒲
绒
飘
走
苍
钩
椰
掉
漂
莓
托
退
沾
涂
滚
蘑
菇
菌
抑
止
